# COGS 108 - EDA Checkpoint

# Names

- Ant Man
- Hulk
- Iron Man
- Thor
- Wasp

<a id='research_question'></a>
# Research Question

*Fill in your research question here*

# Setup

In [2]:
import pandas as pd
import numpy as np
from geopy.geocoders import Nominatim
from geopy.extra.rate_limiter import RateLimiter
from tqdm import tqdm # progress bar for .apply()

# Data Cleaning

Describe your data cleaning steps here.

In [88]:
disaster2015 = pd.read_csv('datasets/nat_disast_bystate_deaths_cost/disaster_2015.csv')
disaster2015

,"2015 Summary of Hazardous Weather Fatalities, Injuries, and Damage Costs by State",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,State,Fatalities,Injuries,Property,Crop,Total
1,NaN,NaN,NaN,Damage,Damage,Damage
2,NaN,NaN,NaN,(million $),(million $),(million $)
3,AK (Alaska),7,8,25,0,25
4,AL (Alabama),13,17,14.79,0,14.79
...,...,...,...,...,...,...
67,WI (Wisconsin),4,8,8.73,0.01,8.74
68,WV (West Virginia),4,2,20.73,0,20.73
69,WY (Wyoming),2,5,10.35,0.25,10.6
70,Total,522,2143,4202.01,645.11,4847.12
71,Report generated: 5/13/2016 3:42:33 PM,NaN,NaN,NaN,NaN,6 / 6

In [89]:
# rename columns
disaster2015.columns = ['state', 'fatalities', 'injuries', 'property_damage', 'crop_damage',
                       'total_damage']
disaster2015.columns

Index(['state', 'fatalities', 'injuries', 'property_damage', 'crop_damage',
       'total_damage'],
      dtype='object')

In [90]:
disaster2015

,state,fatalities,injuries,property_damage,crop_damage,total_damage
0,State,Fatalities,Injuries,Property,Crop,Total
1,NaN,NaN,NaN,Damage,Damage,Damage
2,NaN,NaN,NaN,(million $),(million $),(million $)
3,AK (Alaska),7,8,25,0,25
4,AL (Alabama),13,17,14.79,0,14.79
...,...,...,...,...,...,...
67,WI (Wisconsin),4,8,8.73,0.01,8.74
68,WV (West Virginia),4,2,20.73,0,20.73
69,WY (Wyoming),2,5,10.35,0.25,10.6
70,Total,522,2143,4202.01,645.11,4847.12
71,Report generated: 5/13/2016 3:42:33 PM,NaN,NaN,NaN,NaN,6 / 6

In [91]:
# delete first three rows and last two rows of original dataframe
disaster2015 = disaster2015.drop(labels= [0, 1, 2, 70, 71])

In [92]:
disaster2015 = disaster2015.reset_index(drop= True)
disaster2015

,state,fatalities,injuries,property_damage,crop_damage,total_damage
0,AK (Alaska),7,8,25,0,25
1,AL (Alabama),13,17,14.79,0,14.79
2,AM (Atlantic South),3,0,0,0,0
3,AN (Atlantic North),4,5,0,0,0
4,AR (Arkansas),10,337,18.25,27.26,45.51
...,...,...,...,...,...,...
62,VT (Vermont),0,0,3.55,0,3.55
63,WA (Washington),8,7,28.94,0.02,28.96
64,WI (Wisconsin),4,8,8.73,0.01,8.74
65,WV (West Virginia),4,2,20.73,0,20.73
66,WY (Wyoming),2,5,10.35,0.25,10.6

In [93]:
# check for missing values
disaster2015.isna().sum()

state              0
fatalities         1
injuries           1
property_damage    1
crop_damage        1
total_damage       0
dtype: int64

In [94]:
# find rows that have missing values
disaster2015[disaster2015.isnull().any(axis=1)]

,state,fatalities,injuries,property_damage,crop_damage,total_damage
39,Report generated: 5/13/2016 3:42:33 PM,NaN,NaN,NaN,NaN,5 / 6

In [95]:
disaster2015 = disaster2015.drop(39)
disaster2015

,state,fatalities,injuries,property_damage,crop_damage,total_damage
0,AK (Alaska),7,8,25,0,25
1,AL (Alabama),13,17,14.79,0,14.79
2,AM (Atlantic South),3,0,0,0,0
3,AN (Atlantic North),4,5,0,0,0
4,AR (Arkansas),10,337,18.25,27.26,45.51
...,...,...,...,...,...,...
62,VT (Vermont),0,0,3.55,0,3.55
63,WA (Washington),8,7,28.94,0.02,28.96
64,WI (Wisconsin),4,8,8.73,0.01,8.74
65,WV (West Virginia),4,2,20.73,0,20.73
66,WY (Wyoming),2,5,10.35,0.25,10.6

In [96]:
disaster2015.isna().sum()

state              0
fatalities         0
injuries           0
property_damage    0
crop_damage        0
total_damage       0
dtype: int64

In [97]:
disaster2015.dtypes

state              object
fatalities         object
injuries           object
property_damage    object
crop_damage        object
total_damage       object
dtype: object

In [98]:
disaster2015.loc[0]

state              AK (Alaska)
fatalities                   7
injuries                     8
property_damage             25
crop_damage                  0
total_damage                25
Name: 0, dtype: object

In [99]:
type(disaster2015.loc[0][1])

str

In [101]:
# convert columns to correct data types
disaster2015[['fatalities','injuries', 'property_damage','crop_damage', 'total_damage']] = disaster2015[['fatalities','injuries', 'property_damage','crop_damage', 'total_damage']].apply(pd.to_numeric)

In [102]:
disaster2015.dtypes

state               object
fatalities           int64
injuries             int64
property_damage    float64
crop_damage        float64
total_damage       float64
dtype: object

In [103]:
disaster2015

,state,fatalities,injuries,property_damage,crop_damage,total_damage
0,AK (Alaska),7,8,25.00,0.00,25.00
1,AL (Alabama),13,17,14.79,0.00,14.79
2,AM (Atlantic South),3,0,0.00,0.00,0.00
3,AN (Atlantic North),4,5,0.00,0.00,0.00
4,AR (Arkansas),10,337,18.25,27.26,45.51
...,...,...,...,...,...,...
62,VT (Vermont),0,0,3.55,0.00,3.55
63,WA (Washington),8,7,28.94,0.02,28.96
64,WI (Wisconsin),4,8,8.73,0.01,8.74
65,WV (West Virginia),4,2,20.73,0.00,20.73
66,WY (Wyoming),2,5,10.35,0.25,10.60

In [66]:
disaster2020 = pd.read_csv('datasets/nat_disast_bystate_deaths_cost/disaster_2020.csv')
disaster2020

,"2020 Summary of Hazardous Weather Fatalities, Injuries, and Damage Costs by State",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,State,Fatalities,Injuries,Property,Crop,Total
1,NaN,NaN,NaN,Damage,Damage,Damage
2,NaN,NaN,NaN,(million $),(million $),(million $)
3,AK (Alaska),5,0,35.85,0,35.85
4,AL (Alabama),11,27,313.39,2.08,315.47
...,...,...,...,...,...,...
66,WA (Washington),5,11,1340.16,0.52,1340.68
67,WI (Wisconsin),11,1,79.28,0.26,79.54
68,WV (West Virginia),1,3,5.62,0,5.62
69,WY (Wyoming),0,0,0.03,0,0.03
70,Total,457,1425,26801.89,509.24,27311.13

In [67]:
# rename columns
disaster2020.columns = ['state', 'fatalities', 'injuries', 'property_damage', 'crop_damage',
                       'total_damage']
disaster2020.columns

Index(['state', 'fatalities', 'injuries', 'property_damage', 'crop_damage',
       'total_damage'],
      dtype='object')

In [68]:
disaster2020

,state,fatalities,injuries,property_damage,crop_damage,total_damage
0,State,Fatalities,Injuries,Property,Crop,Total
1,NaN,NaN,NaN,Damage,Damage,Damage
2,NaN,NaN,NaN,(million $),(million $),(million $)
3,AK (Alaska),5,0,35.85,0,35.85
4,AL (Alabama),11,27,313.39,2.08,315.47
...,...,...,...,...,...,...
66,WA (Washington),5,11,1340.16,0.52,1340.68
67,WI (Wisconsin),11,1,79.28,0.26,79.54
68,WV (West Virginia),1,3,5.62,0,5.62
69,WY (Wyoming),0,0,0.03,0,0.03
70,Total,457,1425,26801.89,509.24,27311.13

In [69]:
# delete first three rows and last row of original dataframe
disaster2020 = disaster2020.drop(labels= [0, 1, 2, 70])

In [70]:
disaster2020

,state,fatalities,injuries,property_damage,crop_damage,total_damage
3,AK (Alaska),5,0,35.85,0,35.85
4,AL (Alabama),11,27,313.39,2.08,315.47
5,AM (Atlantic South),0,0,0,0,0
6,AN (Atlantic North),0,0,0.01,0,0.01
7,AR (Arkansas),2,32,313.81,1.41,315.21
...,...,...,...,...,...,...
65,VT (Vermont),0,0,1.91,0.01,1.92
66,WA (Washington),5,11,1340.16,0.52,1340.68
67,WI (Wisconsin),11,1,79.28,0.26,79.54
68,WV (West Virginia),1,3,5.62,0,5.62
69,WY (Wyoming),0,0,0.03,0,0.03

In [71]:
disaster2020 = disaster2020.reset_index(drop= True)
disaster2020

,state,fatalities,injuries,property_damage,crop_damage,total_damage
0,AK (Alaska),5,0,35.85,0,35.85
1,AL (Alabama),11,27,313.39,2.08,315.47
2,AM (Atlantic South),0,0,0,0,0
3,AN (Atlantic North),0,0,0.01,0,0.01
4,AR (Arkansas),2,32,313.81,1.41,315.21
...,...,...,...,...,...,...
62,VT (Vermont),0,0,1.91,0.01,1.92
63,WA (Washington),5,11,1340.16,0.52,1340.68
64,WI (Wisconsin),11,1,79.28,0.26,79.54
65,WV (West Virginia),1,3,5.62,0,5.62
66,WY (Wyoming),0,0,0.03,0,0.03

In [72]:
# check for missing values
disaster2020.isna().sum()

state              0
fatalities         0
injuries           0
property_damage    0
crop_damage        0
total_damage       0
dtype: int64

In [104]:
disaster2020.dtypes

state              object
fatalities         object
injuries           object
property_damage    object
crop_damage        object
total_damage       object
dtype: object

In [105]:
# convert columns to correct data types
disaster2020[['fatalities','injuries', 'property_damage','crop_damage', 'total_damage']] = disaster2020[['fatalities','injuries', 'property_damage','crop_damage', 'total_damage']].apply(pd.to_numeric)

In [106]:
disaster2020.dtypes

state               object
fatalities           int64
injuries             int64
property_damage    float64
crop_damage        float64
total_damage       float64
dtype: object

In [107]:
disaster2020

,state,fatalities,injuries,property_damage,crop_damage,total_damage
0,AK (Alaska),5,0,35.85,0.00,35.85
1,AL (Alabama),11,27,313.39,2.08,315.47
2,AM (Atlantic South),0,0,0.00,0.00,0.00
3,AN (Atlantic North),0,0,0.01,0.00,0.01
4,AR (Arkansas),2,32,313.81,1.41,315.21
...,...,...,...,...,...,...
62,VT (Vermont),0,0,1.91,0.01,1.92
63,WA (Washington),5,11,1340.16,0.52,1340.68
64,WI (Wisconsin),11,1,79.28,0.26,79.54
65,WV (West Virginia),1,3,5.62,0.00,5.62
66,WY (Wyoming),0,0,0.03,0.00,0.03

In [143]:
disaster2016 = pd.read_csv('datasets/nat_disast_bystate_deaths_cost/disaster_2016.csv')
disaster2016

   2016 Summary of Hazardous Weather Fatalities, Injuries, and Damage Costs by State
0                                                 NaN
1                                                 NaN
2   State                          Fatalities     ...
3                  Damage        Damage        Damage
4             (million $)   (million $)   (million $)
..                                                ...
77                                                NaN
78                                                NaN
79                                                NaN
80  Report generated: 5/11/2017 10:46:03 AM       ...
81


[82 rows x 1 columns]

In [144]:
disaster2016.columns

Index(['2016 Summary of Hazardous Weather Fatalities, Injuries, and Damage Costs by State'], dtype='object')

In [145]:
disaster2016 = disaster2016.dropna()

In [146]:
disaster2016

   2016 Summary of Hazardous Weather Fatalities, Injuries, and Damage Costs by State
2   State                          Fatalities     ...
3                  Damage        Damage        Damage
4             (million $)   (million $)   (million $)
5   AK (Alaska)                              4    ...
6   AL (Alabama)                             7    ...
..                                                ...
72  WV (West Virginia)                       24   ...
73  WY (Wyoming)                             6    ...
75  Total                               458       ...
80  Report generated: 5/11/2017 10:46:03 AM       ...
81


[74 rows x 1 columns]

In [147]:
disaster2016['2016 Summary of Hazardous Weather Fatalities, Injuries, and Damage Costs by State'].str.split(expand= True)

,0,1,2,3,4,5,6,7,8
2,State,Fatalities,Injuries,Property,Crop,Total,None,None,None
3,Damage,Damage,Damage,None,None,None,None,None,None
4,(million,$),(million,$),(million,$),None,None,None
5,AK,(Alaska),4,2,0.20,0.00,0.20,None,None
6,AL,(Alabama),7,32,4.31,0.00,4.31,None,None
...,...,...,...,...,...,...,...,...,...
72,WV,(West,Virginia),24,12,172.54,0.00,172.54,None
73,WY,(Wyoming),6,4,3.10,0.00,3.10,None,None
75,Total,458,1276,"18,194.70",243.29,"18,438.00",None,None,None
80,Report,generated:,5/11/2017,10:46:03,AM,6/6,None,None,None
81,None,None,None,None,None,None,None,None,None

In [125]:
# disaster2016.iloc[2]

2016 Summary of Hazardous Weather Fatalities, Injuries, and Damage Costs by State    State                          Fatalities     ...
Name: 2, dtype: object

In [126]:
# disaster2016.columns = disaster2016.iloc[2]

In [127]:
# disaster2016

2  State                          Fatalities     Injuries    Property           Crop          Total
0                                                 NaN
1                                                 NaN
2   State                          Fatalities     ...
3                  Damage        Damage        Damage
4             (million $)   (million $)   (million $)
..                                                ...
77                                                NaN
78                                                NaN
79                                                NaN
80  Report generated: 5/11/2017 10:46:03 AM       ...
81


[82 rows x 1 columns]

In [128]:
# disaster2016 = disaster2016.drop(labels= [2, 3, 4, 80, 81])

In [129]:
# disaster2016

2  State                          Fatalities     Injuries    Property           Crop          Total
0                                                 NaN
1                                                 NaN
5   AK (Alaska)                              4    ...
6   AL (Alabama)                             7    ...
7   AM (Atlantic South)                      4    ...
..                                                ...
75  Total                               458       ...
76                                                NaN
77                                                NaN
78                                                NaN
79                                                NaN

[77 rows x 1 columns]

In [ ]:
# disaster2016[['state', 'B']] = disaster2016['AB'].str.split()

# Data Analysis & Results (EDA)

Carry out EDA on your dataset(s); Describe in this section

In [3]:
## YOUR CODE HERE
## FEEL FREE TO ADD MULTIPLE CELLS PER SECTION